[
  {
    "id": 1,
    "title": "What exactly is Node.js?",
    "text": "Node.js is a JavaScript runtime environment. Sounds great, but what does that mean? How does that work? The Node run-time environment includes everything you need to execute a program written in JavaScript...",
    "link": "https://medium.com/free-code-camp/what-exactly-is-node-js-ae36e97449f5"
  },
  {
    "id": 2,
    "title": "How Does JavaScript Really Work? (Part 1)",
    "text": "What is V8 and what happens under the hood when JavaScript runs?…",
    "link": "https://blog.bitsrc.io/how-does-javascript-really-work-part-1-7681dd54a36d"
  },
  {
    "id": 3,
    "title": "How Does JavaScript Really Work? (Part 2)",
    "text": "How memory management, call stack, threading, and the event loop works with JavaScript’s V8 engine...",
    "link": "https://blog.bitsrc.io/how-does-javascript-work-part-2-40cc15360bc"
  },
  {
    "id": 4,
    "title": "Web Components without a framework: Let’s build a Modal!",
    "text": "How to make a modal component from scratch using vanilla JavaScript. In this post, I will give you a quick overview of what are web components and why are they useful. I will also guide you through the process of making a modal web component from scratch without any framework to better understand its working...",
    "link": "https://blog.bitsrc.io/web-components-without-a-framework-lets-build-a-modal-a450a4536340"
  },
  {
    "id": 5,
    "title": "Creating a Reusable Accordion Component That Works Anywhere",
    "text": "Web Components is the hottest trend in web development and it’s only going to gain momentum since most of the major browsers now support them. Web components are custom made tags which extend HTML’s capabilities...",
    "link": "https://blog.bitsrc.io/creating-a-reusable-accordion-component-that-works-anywhere-2f2add05baa4"
  },
  {
    "id": 6,
    "title": "Build a Unit-Testing Suite with Mocha and Mongoose",
    "text": "Over a period of time, your application will have more lines of code for testing than the actual application logic. So I feel it’s a good investment to learn to write tests and follow a Test Driven Development or TDD approach...",
    "link": "https://blog.bitsrc.io/build-a-unit-testing-suite-with-mocha-and-mongoose-eba06c3b3625"
  },
  {
    "id": 7,
    "title": "Understanding a RESTful API using Node.js, TypeScript and Pokemon",
    "text": "In this post, we will learn to make a simple REST API with a .json file as database. Most of the tutorials out there teach you to build a TODO app using Node.js, Express.js with JavaScript. To learn something new, we will use TypeScript and make a pokemon API to read data from json file...",
    "link": "https://blog.bitsrc.io/understanding-a-restful-api-using-node-js-and-typescript-6f9cede6b579"
  }
]
